Repository: leoalmeida99/pt.quarkus.io
Catalog: l10n/po/*/_guides/drools.adoc.po
Languages: pt_br

source: Defining and executing business rules with Drools
pt_br: Definindo e executando regras de negócio com Drools

source: This guide demonstrates how your Quarkus application can use https://www.drools.org[Drools] to add intelligent automation and power it up with the Drools rule engine.
pt_br: Esse guia demonstra como sua aplicação Quarkus pode usar o https://www.drools.org[Drools] para adicionar automação inteligente e potencializá-la com o mecanismo de regras do Drools.

source: Prerequisites
pt_br: Pré-requisitos

source: Introduction
pt_br: Introdução

source: https://www.drools.org[Drools] is a set of projects focusing on intelligent automation and decision management, most notably providing a forward-chaining and backward-chaining inference-based rule engine, DMN decisions engine and other projects. A rule engine is a fundamental building block to create an expert system which, in artificial intelligence, is a computer system that emulates the decision-making ability of a human expert. You can read more information on the https://www.drools.org[Drools website].
pt_br: https://www.drools.org[Drools] é um conjunto de projetos que se concentra na automação inteligente e no gerenciamento de decisões, principalmente fornecendo um em mecanismo de regras baseado em inferência de encadeamento para frente e encadeamento para trás, um mecanismo de decisões DMN e outros projetos. Uma mecanismo de regras é um bloco fundamental para criar um sistema especializado que, em inteligência artificial, é um sistema computacional que emula a capacidade de tomada de decisões de um especialista humano. Você pode ler mais informações no https://www.drools.org[site do Drools].

source: Drools allows defining rules with 2 different programming styles: one more traditional based on the concepts of a KieBase acting as a repository of business rules and a KieSession storing and evaluating the runtime data against them, and the other using a Rule Unit as a single abstraction that encapsulates the definitions of both a set of rules and the facts against which those rules will be matched.
pt_br: O Drools permite a definição de regras com dois estilos de programação diferentes: um mais tradicional baseado nos conceitos de uma KieBase, que atua como um repositório de regras de negócio e uma KieSession, que armazena e avalia os dados em tempo de execução com base nessas regras; e outro que utiliza uma unidade de regra como uma abstração única que encapsula as definições de um conjunto de regras e os fatos contra os quais essas regras serão comparadas.

source: Both these styles are fully supported in the Drools Quarkus extension and this document explains how to use both, outlining the pros and cons of each one.
pt_br: Ambos os estilos são totalmente suportados na extensão do Drools para Quarkus, e este documento explica como usar cada um deles, destacando os prós e os contras de cada abordagem.

source: Integrating the traditional Drools programming model with Quarkus
pt_br: Integração do modelo de programação tradicional do Drools com o Quarkus

source: This first example demonstrates how to define a set of rules using the traditional Drools style and how to expose their evaluation inside a REST endpoint through Quarkus.
pt_br: Este primeiro exemplo demonstra como definir um conjunto de regras usando o estilo tradicional do Drools e como expor sua avaliação em um endpoint REST por meio do Quarkus.

source: The domain model of this sample project is made only by two classes, a loan application
pt_br: O modelo de domínio desse projeto de exemplo é composto por apenas duas classes, uma solicitação de empréstimo

source: and the applicant who requested it
pt_br: e o solicitante que a requisitou

source: The rules set is made of business decisions to approve or reject an application plus one last rule collecting all the approved applications into a list.
pt_br: O conjunto de regras é composto por decisões de negócios para aprovar ou rejeitar uma solicitação, além de uma última regra que coleta todas as solicitações aprovadas em uma lista.

source: The goal that we want to achieve is putting the evaluation of these rules in a microservice, exposing them in a REST endpoint developed with Quarkus. To do so it is enough to add the Drools Quarkus extension among the dependencies of your project.
pt_br: O objetivo que queremos alcançar é colocar a avaliação dessas regras em um microsserviço, expondo-as em um endpoint REST desenvolvido com Quarkus. Para isso, basta adicionar a extensão Drools do Quarkus entre as dependências do seu projeto.

source: and at this point it is possible to obtain a reference to the KieSession evaluating the formerly defined rules and use it in a REST endpoint as it follows:
pt_br: e, nesse ponto, é possível obter uma referência à KieSession, que avalia as regras definidas anteriormente, e usá-la em um endpoint REST, da seguinte forma:

source: where an implementation of the `KieRuntimeBuilder` interface is automatically generated and made injectable for you by the Drools extension and allows to obtain with a single statement an instance of any KieBases and KieSessions defined in your Drools project.
pt_br: onde uma implementação da interface 'KieRuntimeBuilder' é automaticamente gerada e disponibilizada para injeção pela extensão Drools, e permite obter com uma única instrução, uma instância de qualquer KieBases e KieSessions definidos em seu projeto Drools.

source: Here the `LoanAppDto` is a simple POJO used to submit multiple loan application to the same KieSession
pt_br: Aqui o `LoanAppDto` é um POJO simples usado para enviar várias solicitações de empréstimos para a mesma KieSession

source: thus trying for example to invoke that endpoint with a set of loan applications
pt_br: assim, tentando, por exemplo, invocar esse endpoint com um conjunto de solicitações de empréstimo

source: the rule engine will evaluate them against the business rules we have configured before, returning the only one that in this case can be approved according to them
pt_br: o mecanismo de regras vai avaliá-las novamente em relação às regras de negócio que configuramos anteriormente, retornando a única que, nesse caso, pode ser aprovada de acordo com elas

source: Moving to the rule unit programming model
pt_br: Migrando para o modelo de programação de unidades de regra

source: A rule unit is a new concept introduced in Drools encapsulating both a set of rules and the facts against which those rules will be matched. It comes with a second abstraction called data source, defining the sources through which the facts are inserted, acting in practice as typed entry-points. There are two types of data sources:
pt_br: Uma unidade de regra é um novo conceito introduzido no Drools que encapsula tanto um conjunto de regras quanto os fatos contra os quais essas regras serão avaliadas. Ela traz uma segunda abstração chamada de fonte de dados, que define as fontes pelas quais os fatos são inseridos, agindo na prática como pontos de entrada tipados. Existem dois tipos de fontes de dados:

source: DataStream: an append-only data source
pt_br: Stream de dados: uma fonte de dados apenas para adição

source: subscribers only receive new (and possibly past) messages
pt_br: os assinantes recebem apenas mensagens novas (e possivelmente anteriores)

source: cannot update/remove
pt_br: não é possível atualizar/remover

source: stream may also be hot/cold in “reactive streams” terminology
pt_br: o fluxo também pode ser quente/frio na terminologia de "fluxos reativos"

source: DataStore: data source for modifiable data
pt_br: Armazenamento de dados: uma fonte de dados para dados modificáveis

source: subscribers may act upon the data store, by acting upon the fact handle
pt_br: os assinantes podem interagir com o armazenamento de dados, atuando sobre o identificador de fatos

source: In order to use rule units in our quarkus application it is necessary to add a second dependency.
pt_br: Para utilizar unidades de regras em nossa aplicação Quarkus, é necessário adicionar uma segunda dependência.

source: In essence a rule unit is made of 2 strictly related parts: the definition of the fact to be evaluated and the set of rules evaluating them. The first part is implemented with a POJO, that for the loan example could be something like the following:
pt_br: Em essência, uma unidade de regra é composta de duas partes estritamente relacionadas: a definição do fato a ser avaliado e o conjunto de regras que o avaliam. A primeira parte é implementada com um POJO, que, no exemplo do empréstimo, poderia ser algo como o seguinte:

source: Here instead of using the `LoanAppDto` that we introduced to marshall/unmarshall the JSON requests we are binding directly the class representing the rule unit. The two relevant differences are that it implements the `RuleUnitData` interface and uses a `DataStore` instead of a plain `List` containing the loan applications to be approved. The first is just a marker interface to notify the engine that this class is part of a rule unit definition. The use of a `DataStore` is necessary to let the rule engine to react accordingly to the changes by firing new rules and triggering other rules. In the example, the consequences of the rules modify the approved property of the loan applications. Conversely, the `maxAmount` value can be considered a configuration parameter of the rule unit and left as it is: it will automatically be processed during the rules evaluation with the same semantic of a global, and automatically set from the value passed by the JSON request as in the first example, so you will still be allowed to use it in your rules.
pt_br: Aqui, em vez de usarmos o `LoanAppDto` que introduzimos para serializar/deserializar as solicitações JSON, estamos vinculando diretamente a classe que representa a unidade de regras. As duas diferenças principais são que essa classe implementa a interface `RuleUnitData` e utiliza um `DataStore` em vez de um simples `List` contendo as solicitações de empréstimo a serem aprovadas. A primeira é apenas uma interface de marcação para indicar ao mecanismo de regras que essa classe faz parte da definição de uma unidade de regras. O uso de um `DataStore` é necessário para permitir que o mecanismo de regras reaja às alterações, disparando novas regras e acionando outras regras. No exemplo, as regras modificam a propriedade aprovada das solicitações de empréstimo. Por outro lado, o valor de `maxAmount` pode ser considerado um parâmetro de configuração da unidade de regras e deixado como está: ele será automaticamente processado durante a avaliação das regras com a mesma semântica de uma variável global e será definido automaticamente a partir do valor passado na solicitação JSON, como no primeiro exemplo, permitindo que você ainda possa usá-lo em suas regras.

source: The second part of the rule unit is the drl file containing the rules belonging to this unit.
pt_br: A segunda parte da unidade de regras é o arquivo DRL que contém as regras pertencentes a essa unidade.

source: This rules file must declare the same package and a unit with the same name of the Java class implementing the `RuleUnitData` interface in order to state that they belong to the same rule unit.
pt_br: Esse arquivo de regras deve declarar o mesmo pacote e uma unidade com o mesmo nome da classe Java que implementa a interface `RuleUnitData` para indicar que pertencem à mesma unidade de regras.

source: This file has also been rewritten using the new OOPath notation: as anticipated, here the data source acts as a typed entry-point and the oopath expression has its name as root while the constraints are in square brackets, like in the following example.
pt_br: Esse arquivo também foi reescrito usando a nova notação OOPath: como antecipado, aqui a fonte de dados atua como um ponto de entrada tipado, e a expressão OOPath tem seu nome como raiz, enquanto as restrições estão entre colchetes, como no exemplo a seguir.

source: Alternatively you can still use the old DRL syntax, specifying the name of the data source as an entry-point, with the drawback that in this case you need to specify again the type of the matched object, even if the engine can infer it from the type of the datasource, as it follows.
pt_br: Alternativamente, você ainda pode usar a antiga sintaxe do DRL, especificando o nome da fonte de dados como um entry-point, com a desvantagem de que, nesse caso, é necessário especificar novamente o tipo do objeto correspondente, mesmo que o mecanismo possa inferi-lo a partir do tipo da fonte de dados, como mostrado a seguir.

source: Finally note that the last rule collecting all the approved loan applications into a global `List` has been replaced by a query simply retrieving them. One of the advantages in using a rule unit is that it clearly defines the context of computation, in other terms the facts to be passed in input to the rule evaluation. Similarly, the query defines what is the output expected by this evaluation.
pt_br: Por fim, note que a última regra que reunia todos os pedidos de empréstimos aprovados em um 'List' global foi substituída por uma consulta que simplesmente os recupera. Uma das vantagens de usar uma unidade de regra é que ela define claramente o contexto da computação, ou seja, os fatos que devem ser passados como entrada para a avaliação das regras. Da mesma forma, a consulta define qual é o resultado esperado por essa avaliação.

source: This clear definition of the computation boundaries allows Drools to also automatically generate a class executing the query and returning its results, together with a REST endpoint taking the rule unit as input, passing it to the former query executor and returning its as output.
pt_br: Essa definição clara dos limites da computação permite que o Drools também gere automaticamente uma classe que executa a consulta e retorna seus resultados, juntamente com um endpoint REST que recebe a unidade de regra como entrada, a repassa para o executor da consulta e retorna seu resultado como saída.

source: You can have as many query as you want and for each of them it will be generated a different REST endpoint with the same name of the query transformed from camel case (like `FindApproved`) to dash separated (like `find-approved`).
pt_br: Você pode ter quantas consultas quiser, e para cada uma delas será gerado um endpoint REST diferente, com o mesmo nome da consulta transformado de camel case (como FindApproved) para um formato separado por hífens (comofind-approved).

source: A more comprehensive example
pt_br: Um exemplo mais abrangente

source: In this more comprehensive and complete example, we will augment a basic Quarkus application with a few simple rules to infer potential issues with the status of a home automation setup.
pt_br: Nesse exemplo mais abrangente e completo, vamos expandir uma aplicação básica do Quarkus com algumas regras simples para inferir possíveis problemas no status de uma configuração de automação doméstica.

source: We will define a Drools Rule Unit and the rules in the DRL format.
pt_br: Definiremos uma Unidade de Regras do Drools e as regras no formato DRL.

source: We will wire the Rule Unit into a standard Quarkus CDI bean, for use in the Quarkus application (for instance, wiring MQTT messages from Kafka, etc.).
pt_br: Vamos integrar a Unidade de Regras a um bean CDI padrão do Quarkus, para utilização na aplicação Quarkus (por exemplo, conectando mensagens MQTT do Kafka, etc.).

source: To complete this guide, you need:
pt_br: Para concluir este guia, você precisa:

source: less than 15 minutes
pt_br: menos de que 15 minutos

source: an IDE
pt_br: uma IDE

source: JDK 17+ installed with `JAVA_HOME` configured appropriately
pt_br: JDK 17+ instalado com `JAVA_HOME` configurado corretamente

source: link:{https://quarkus.io/guides/building-native-image}[GraalVM installed] if you want to run in native mode
pt_br: link:{https://quarkus.io/guides/building-native-image}[GraalVM instalado] se você quiser executar em modo nativo

source: Creating the Maven Project
pt_br: Criando o projeto Maven

source: First, we need a new Quarkus project. To create a new Quarkus project, you can reference the link:{https://quarkus.io/guides/maven-tooling}[Quarkus and Maven Guide]
pt_br: Primeiro, precisamos de um novo projeto Quarkus. Para criar um novo projeto Quarkus, você pode usar como referência o link:{https://quarkus.io/guides/maven-tooling}[Guia de Quarkus e Maven]

source: When you have your Quarkus project configured, you can add the Drools Quarkus extensions to your project by adding the following dependencies to your `pom.xml`:
pt_br: Quando o seu projeto Quarkus estiver configurado, você pode adicionar as extensões do Drools para Quarkus ao seu projeto adicionando as seguintes dependências ao seu `pom.xml`:

source: Writing the application
pt_br: Escrevendo o aplicativo

source: Let's start from the application domain model.
pt_br: Vamos começar pelo modelo de domínio do aplicativo.

source: This application goal is to infer potential issues with the status of a home automation setup, so we create the necessary domain models to represent status of sensors, devices and other things inside the house.
pt_br: O objetivo desta aplicação é inferir possíveis problemas no status de uma configuração de automação residencial, para isso, criamos os modelos de domínio necessários para representar o status de sensores, dispositivos e outros elementos dentro da casa.

source: Light device domain model:
pt_br: Modelo de domínio do dispositivo de luz:

source: CCTV security camera domain model:
pt_br: Modelo de domínio da câmera de segurança CCTV:

source: Smartphone detected in WiFi domain model:
pt_br: Modelo de domínio do Smartphone detectado no WiFi:

source: Alert class to hold information of the potential detected problems:
pt_br: Classe de alerta para armazenar informações sobre os possíveis problemas detectados:

source: Next, we create a rule file `rules.drl` inside the `src/main/resources/org/drools/quarkus/quickstart/test` folder of the Quarkus project.
pt_br: Em seguida, criamos um arquivo de regras `rules.drl` dentro da pasta `src/main/resources/org/drools/quarkus/quickstart/test` no projeto Quarkus.

source: In this file there are some example rules to decide whether the overall status of the house is deemed inappropriate, triggering the necessary `Alert` (s).
pt_br: Nesse arquivo, há algumas regras de exemplo para decidir se o status geral da casa é considerado inadequado, acionando o(s) `Alerta`(s) necessário(s).

source: Rule Unit a central paradigm introduced in Drools 8 that helps users to encapsulate the set of rules and the facts against which those rules will be matched; you can read more information in the https://www.drools.org/learn/documentation.html[Drools documentation].
pt_br: O paradigma central da Unidade de Regra foi introduzido no Drools 8 para ajudar os usuários a encapsular o conjunto de regras e os fatos contra os quais essas regras serão combinadas; você pode ler mais informações na https://www.drools.org/learn/documentation.html[documentação do Drools].

source: The facts will be inserted into a `DataStore`, a type-safe entry point. To make everything work, we need to define both the RuleUnit and the DataStore.
pt_br: Os fatos serão inseridos em um `DataStore`, um ponto de entrada com segurança de tipo. Para que tudo funcione, precisamos definir tanto a Unidade de Regra quanto o DataStore.

source: Testing the Application
pt_br: Testando a aplicação

source: We can create a standard Quarkus and JUnit test to check the behaviour of the Rule Unit and the defined rules, accordingly to a certain set of scenarios.
pt_br: Podemos criar um teste padrão Quarkus e JUnit para verificar o comportamento da Unidade de Regra e das regras definidas, de acordo com determinado conjunto de cenários.

source: Wiring the Rule Unit with Quarkus CDI beans
pt_br: Conectando a Unidade de Regra com os beans CDI do Quarkus

source: We can now wire the Rule Unit into a standard Quarkus CDI bean, for general use in the Quarkus application.
pt_br: Agora podemos conectar a Unidade de Regra a um bean CDI padrão do Quarkus, para uso geral na aplicação Quarkus.

source: For example, this might later be helpful to wire device status reporting through MQTT via Kafka, using the appropriate Quarkus extensions.
pt_br: Por exemplo, isso pode ser útil mais tarde para conectar o relatório de status dos dispositivos via MQTT através do Kafka, usando as extensões apropriadas do Quarkus.

source: We create a simple CDI bean to abstract away the Rule Unit API usage with:
pt_br: Criamos um bean CDI simples para abstrair o uso da API Rule Unit:

source: The same test scenarios can be refactored using this CDI bean accordingly.
pt_br: Os mesmos cenários de teste podem ser refatorados usando esse bean CDI adequadamente.
