Repository: leoalmeida99/pt.quarkus.io
Catalog: l10n/po/*/_guides/extension-maturity-matrix.adoc.po
Languages: pt_br

source: A maturity matrix for Quarkus extensions
pt_br: Uma matriz de maturidade para extensões Quarkus

source: What makes a good Quarkus extension? What capabilities is a Quarkus extension expected to provide? Of course, it depends on the extension you are building. But, we found a set of attributes common to many extensions. This document explains what they are.
pt_br: O que faz uma boa extensão Quarkus? Que recursos se espera que uma extensão do Quarkus ofereça? É claro que isso depende da extensão que você está criando. Porém, encontramos um conjunto de características comuns a muitas extensões. Essa documentação explica quais são elas.

source: This isn't defining an exact order, even within a single row. Different extensions have different goals, and different developers will have different views on what capabilities are most important. You may wish to (for example) prioritise a fantastic programming model over enhancing your extension's Dev UI tile. That's fine!
pt_br: Isso não está definindo uma ordem exata, mesmo em uma única linha. Extensões diferentes têm objetivos diferentes, e desenvolvedores diferentes terão visões diferentes sobre quais recursos são mais importantes. Você pode desejar (por exemplo) priorizar um modelo de programação fantástico, em vez de aprimorar o bloco de interface de usuário do desenvolvedor da sua extensão. E tudo bem!

source: Also, not every step will apply to every extension. For example, you don't need a Dev Service if your extension doesn't depend on external services.
pt_br: Além disso, nem todas as etapas se aplicam a todas as extensões. Por exemplo, você não precisa de um serviço de desenvolvimento se sua extensão não depender de serviços externos.

source: It's completely OK to publish a first version of an extension that doesn't handle everything. In fact, it's OK if your extension _never_ gets to the more advanced features. This is a suggested pathway, not a minimum feature set.
pt_br: Não há problema algum em publicar uma primeira versão de uma extensão que não lide com tudo. Na verdade, não tem problema se sua extensão _nunca_ chegar aos recursos mais avançados. Este é um caminho sugerido, não um conjunto mínimo de funcionalidades.

source: Also note that this list only includes the technical features of your extension. You might also want to think about how you share your extension, and how it presents itself to the world. The link:https://hub.quarkiverse.io/checklistfornewprojects/[new extension checklist] on the Quarkiverse Hub has a useful list of ways extensions can participate in the ecosystem. It's also a good idea to spend some time on the metadata in the xref:extension-metadata.adoc#quarkus-extension-yaml[`quarkus-extension.yaml` file], which is used by Quarkus tooling.
pt_br: Observe também que esta lista inclui apenas as funcionalidades técnicas de sua extensão. Você talvez também queira pensar, sobre como você compartilha sua extensão e como ela se apresenta ao mundo. O link:https://hub.quarkiverse.io/checklistfornewprojects/[checklist para novas extensões] no Quarkiverse Hub tem uma lista útil de maneiras pelas quais as extensões podem participar do ecossistema. Também é uma boa ideia dedicar algum tempo aos metadados no arquivo xref:extension-metadata.adoc#quarkus-extension-yaml[`quarkus-extension.yaml`], que é usado pelas ferramentas do Quarkus.

source: Here are some pointers on how to achieve those capabilities.
pt_br: Aqui estão algumas dicas sobre como obter esses recursos.

source: Run modes
pt_br: Modos de execução

source: Quarkus applications can be run as a normal jar-based JVM application, or live-coded in dev mode, or compiled to a native binary. Each environment places different demands on framework extensions.
pt_br: As aplicações Quarkus podem ser executadas como uma aplicação jar baseada na JVM, ou codificadas ao vivo no modo de desenvolvimento, ou compiladas para um binário nativo. Cada ambiente impõe diferentes demandas às extensões do framework.

source: Works in JVM mode
pt_br: Funciona em modo JVM

source: For most extensions, this is the minimum expectation. When wrapping an existing library, this is usually trivial to achieve; if an extension is providing net-new capability, it might be a bit more work. Quarkus provides tools for xref:writing-extensions.adoc#testing-extensions[unit testing and integration testing] extensions.
pt_br: Para a maioria das extensões, essa é a expectativa mínima. Quando encapsulamos uma biblioteca existente, isso é geralmente trivial de se conseguir; se uma extensão está fornecendo um recurso totalmente novo, pode ser um pouco mais trabalhoso. O Quarkus fornece ferramentas para xref:writing-extensions.adoc#testing-extensions[testes de unidades e testes de integrações] em extensões.

source: Works in dev mode
pt_br: Funciona em modo de desenvolvimento

source: In some cases, extra work may be needed to ensure any wrapped libraries can tolerate dev mode, since the classloading is different and hot reloading can break some assumptions. Extensions may also wish to add some xref:writing-extensions.adoc#integrating-with-development-mode[special handling for dev mode]. To add automated tests which validate dev mode, you can xref:writing-extensions.adoc#testing-hot-reload[add tests which extend the `QuarkusDevModeTest`].
pt_br: Em alguns casos, pode ser necessário um trabalho extra para garantir que bibliotecas encapsuladas consigam tolerar o modo de desenvolvimento, já que o carregamento de classes é diferente e o hot reloading pode quebrar algumas suposições. As extensões podem também querer adicionar algum xref:writing-extensions.adoc#integrating-with-development-mode[tratamento especial para o modo de desenvolvimento]. Para adicionar testes automatizados que validem o modo de desenvolvimento, você pode xref:writing-extensions.adoc#testing-hot-reload[adicionar testes que estendem o `QuarkusDevModeTest`].

source: Works as a native application
pt_br: Funciona como uma aplicação nativa

source: For many libraries, native mode support is the primary motivation for creating an extension. See xref:writing-extensions.adoc#native-executable-support[the guide on native executable support] for more discussion about some of the adaptations that might be needed.
pt_br: Para muitas bibliotecas, o suporte ao modo nativo é a principal motivação para a criação de uma extensão. Consulte o xref:writing-extensions.adoc#native-executable-support[guia de suporte para executáveis nativos] para mais informações sobre algumas das adaptações que podem ser necessárias.

source: Developer Joy
pt_br: Alegria em desenvolver

source: Developer Joy is an important Quarkus principle. Here are some extension capabilities that contribute to joyful development.
pt_br: A alegria do desenvolver é um principio importante do Quarkus. Aqui estão algumas extensões de recursos que contribuem para um desenvolvimento feliz.

source: Configuration support
pt_br: Suporte de configuração

source: Extensions should support Quarkus's unified configuration, by xref:writing-extensions.adoc#configuration[integrating with the Quarkus configuration model]. The Writing Extensions guide has more guidance on xref:writing-extensions.adoc#how-to-expose-configuration[the Quarkus configuration philosophy].
pt_br: As extensões devem oferecer suporte à configuração unificada do Quarkus, por meio da xref:writing-extensions.adoc#configuration[integração com o modelo de configuração do Quarkus]. O guia _Writing Extensions_ oferece mais orientações sobre xref:writing-extensions.adoc#how-to-expose-configuration[a filosofia de configuração do Quarkus].

source: Quarkus extensions should aim to xref:writing-extensions.adoc#expose-your-components-via-cdi[expose components via CDI], so that they can be consumed in a frictionless way by user applications. Having everything injectable as CDI beans also helps testing, especially xref:getting-started-testing.adoc#mock-support[mocking].
pt_br: As extensões do Quarkus devem buscar xref:writing-extensions.adoc#expose-your-components-via-cdi[expor componentes via CDI], permitindo que sejam consumidas de forma descomplicada por aplicações dos usuários. Ter tudo injetável como beans CDI também ajuda nos testes, especialmente os xref:getting-started-testing.adoc#mock-support[mocks].

source: Dev Service
pt_br: Serviço de desenvolvimento

source: Dev Services are generally relevant for extensions that "connect" to something, such as databases for datasources, a keycloak instance for security, an Apache Kafka instance for messaging, etc.
pt_br: Serviço de desenvolvimento são geralmente relevantes para extensões que "se conectem" a algo, tal como banco de dados para fonte de dados, uma instância do Keycloack para segurança, uma instância do Apache Kafka para sistemas de mensagens, etc.

source: To provide a Dev Service, use the `DevServicesResultBuildItem` build item. See the xref:extension-writing-dev-service.adoc[Dev Services how-to] for more information.
pt_br: Para fornecer um serviço de desenvolvimento, use o item de compilação `DevServicesResultBuildItem`. Consulte o xref:extension-writing-dev-service.adoc[guia de como criar um serviço de desenvolvimento] para mais informações.

source: Basic Dev UI
pt_br: Interface de usuário para desenvolvimento básica

source: Every extension gets a tile in the Dev UI. The default tile pulls information from the xref:extension-metadata.adoc[extension metadata], which is another reason to spend a bit of time getting the metadata right.
pt_br: Cada extensão possui um bloco na interface de usuário do desenvolvedor. O bloco padrão extrai informações dos xref:extension-metadata.adoc[metadados da extensão], o que é mais um motivo para dedicar algum tempo para obter os metadados corretos.

source: Extensions also use Dev UI hooks to present extra information to users. For example, the tile could include a link to an external console, or an internal page which presents simple text metrics. See the xref:dev-ui.adoc[Dev UI for extension developers] guide.
pt_br: As extensões também utilizam ganchos da interface de usuário do desenvolvedor para apresentar informações adicionais aos usuários. Por exemplo, o bloco poderia incluir um link para um console externo, ou uma página interna que exiba métricas simples em texto. Consulte o guia de xref:dev-ui.adoc[interface de usuário do desenvolvedor para desenvolvedores de extensões].

source: Rich Dev UI
pt_br: Interface de usuário para desenvolvimento avançada

source: Some extensions provide extremely sophisticated Dev UIs. For example, they might allow users to interact with the running application, xref:dev-ui.adoc#hot-reload[respond to reloads], visualise application metrics, or xref:dev-ui.adoc#add-a-log-to-the-footer[stream an application-specific log]. The xref:dev-ui.adoc[Dev UI for extension developers] guide also explains these more advanced options.
pt_br: Algumas extensões fornecem interfaces de usuário para desenvolvedores extremamente sofisticadas. Por exemplo, eles podem permitir que usuários interajam com a aplicação em execução, xref:dev-ui.adoc#hot-reload[respondam a recarregamentos], visualizem métricas da aplicação, ou xref:dev-ui.adoc#add-a-log-to-the-footer[transmitam um log específico da aplicação]. O guia xref:dev-ui.adoc[interface de usuário de desenvolvimento para desenvolvedores de extensões] também explica essas opções mais avançadas.

source: Joyful programming model
pt_br: Modelo de programação agradável

source: For some inspiration in this area, have a look at xref:logging.adoc#simplified-logging[simplified logging], xref:hibernate-orm-panache.adoc[simplified Hibernate ORM with Panache], the xref:rest-client.adoc#query-parameters[`@RestQuery` annotation], or the way Quarkus allows test containers to be used xref:getting-started-dev-services.adoc[without any configuration].
pt_br: Para se inspirar nessa área, confira o xref:logging.adoc#simplified-logging[logging simplificado], o xref:hibernate-orm-panache.adoc[Hibernate ORM simplificado com Panache], a xref:rest-client.adoc#query-parameters[anotação `@RestQuery`], ou a maneira como o Quarkus permite que os test containers sejam usados xref:getting-started-dev-services.adoc[sem qualquer configuração].

source: Codestart application template
pt_br: Modelo de aplicação de Codestart

source: Codestarts are templates which can be used to generate applications for users. Extensions can xref:extension-codestart.adoc[provide their own codestart templates].
pt_br: Codestarts são modelos que podem ser usados para gerar aplicações para usuários. Extensões podem xref:extension-codestart.adoc[fornecer seus próprios modelos de codestart].

source: Supersonic subatomic performance
pt_br: Desempenho Subatômico Supersônico

source: Extensions should use build-time application knowledge to eliminate wasteful runtime code paths. We call this supersonic subatomic performance. Because Quarkus moves work to the build stage, Quarkus applications should have fast startup, high throughput, and low memory requirements. Performance tuning is a large subject, but extensions should use build-time application knowledge to eliminate wasteful runtime code paths at runtime.
pt_br: As extensões devem usar o conhecimento da aplicação em tempo de compilação, para eliminar caminhos de código desnecessários em tempo de execução. Chamamos isso de desempenho subatômico supersônico. Como o Quarkus transfere o trabalho para o estágio de compilação, aplicações Quarkus devem ter uma inicialização rápida, alta taxa de transferência e requerer pouca memória. O ajuste de desempenho é um assunto extenso, mas as extensões devem usar o conhecimento da aplicação em tempo de compilação para eliminar caminhos de código desnecessários em tempo de execução.

source: Static initialization
pt_br: Inicialização estática

source: Do as much initialization as much as possible statically. This avoid runtime overhead.
pt_br: Faça o máximo de inicialização possível de forma estática. Isso evita a sobrecarga em tempo de execução.

source: Replace reflection with generated bytecode
pt_br: Substitua a reflexão por bytecode gerado

source: For a case study of how to eliminate reflection and what the performance benefits turned out to be, see https://quarkus.io/blog/quarkus-metaprogramming/[reflectionless Jackson serialization]
pt_br: Para um caso de estudo em como eliminar reflexão e o que beneficia a performance transformado fora de ser, veja a https://quarkus.io/blog/quarkus-metaprogramming/[serialização Jackson sem reflexão]

source: Virtual thread support
pt_br: Suporte a threads virtuais

source: Not every library is suitable for using with virtual threads, out of the box. xref:virtual-threads.adoc#why-not["Why not virtual threads everywhere?"] explains why.
pt_br: Nem toda biblioteca é adequada para o uso de threads virtuais de imediato. xref:virtual-threads.adoc#why-not["Por que não usar threads virtuais em todos os lugares?"] explica o motivo.

source: To get your library working properly with virtual threads, you should make sure the library is not pinning the carrier thread. Quarkus has xref:virtual-threads.adoc#testing-virtual-thread-applications[test helpers to do these checks in an automated way]. For dispatching work, you should use the xref:virtual-threads.adoc#inject-the-virtual-thread-executor[virtual executor managed by Quarkus]. The link:https://quarkus.io/extensions/io.quarkus/quarkus-websockets-next/[WebSockets-next extension] uses the virtual dispatcher and smart dispatch, and is a good example to follow.
pt_br: Para que sua biblioteca funcione corretamente com threads virtuais, você deve garantir que ela não esteja fixando a thread de transporte. O Quarkus possui xref:virtual-threads.adoc#testing-virtual-thread-applications[test helpers para fazer essas verificações de forma automatizada]. Para despachar o trabalho, você deve usar o xref:virtual-threads.adoc#inject-the-virtual-thread-executor[executor virtual gerenciado pelo Quarkus]. A link:https://quarkus.io/extensions/io.quarkus/quarkus-websockets-next/[extensão WebSockets-next] utiliza o despachante virtual e o despacho inteligente, e é um bom exemplo a ser seguido.

source: Hot path performance optimization
pt_br: Otimização do desempenho do hot path

source: Although Quarkus offers some unique opportunities for extension performance, extension developers shouldn't forget https://www.linkedin.com/pulse/how-optimize-software-performance-efficiency-subcodevs/[the basics of performance optimization].
pt_br: Embora o Quarkus ofereça algumas oportunidades únicas para o desempenho de extensões, os desenvolvedores de extensão não devem esquecer https://www.linkedin.com/pulse/how-optimize-software-performance-efficiency-subcodevs/[os fundamentos de otimização de desempenho].

source: Non-blocking internals
pt_br: Internos não bloqueantes

source: Quarkus's reactive core is a key contributor to its excellent throughput and scalability. Extensions should consider adopting this model for their own internal operations.
pt_br: O núcleo reativo do Quarkus é um dos principais responsáveis por sua excelente taxa de transferência e escalabilidade. As extensões devem considerar adotar esse modelo para suas próprias operações internas.

source: Add Mutiny-based APIs
pt_br: Adicione APIs baseadas no Mutiny

source: For maximum scalability, go beyond the reactive core and enable fully reactive programming, using Mutiny. Most projects that support a reactive programming model offer two distinct extensions, a `-reactive` and a plain one. See, for example, https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch/quarkus-elasticsearch/[ElasticSearch] and https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch-reactive/quarkus-elasticsearch-reactive/[ElasticSearch Reactive] extensions.
pt_br: Para obter a máxima escalabilidade, vá além do núcleo reativo e habilite a programação totalmente reativa, usando o Mutiny. A maioria dos projetos que suportam um modelo de programação reativa oferece duas extensões distintas: uma `-reactive` e outra padrão. Veja, por exemplo, as extensões https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch/quarkus-elasticsearch/[ElasticSearch] e https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch-reactive/quarkus-elasticsearch-reactive/[ElasticSearch Reactive].

source: Operations
pt_br: Operações

source: Developer joy is important, but so are observability, maintainability, and other operational considerations. Many of these characteristics come by default with the Quarkus framework or https://quarkus.io/extensions/io.quarkus/quarkus-opentelemetry/[observability-focussed extensions]. But extensions can do more.
pt_br: A satisfação do desenvolvedor é importante, mas a observabilidade, a manutenibilidade e outras considerações operacionais também são. Muitas dessas características vêm por padrão com o framework Quarkus ou com https://quarkus.io/extensions/io.quarkus/quarkus-opentelemetry/[extensões focadas em observabilidade]. No entanto, as extensões podem ir além.

source: Logging
pt_br: Registrando

source: Quarkus uses JBoss Logging as its logging engine, and xref:logging.adoc[supports several logging APIs]. (This is normal Java logging, not OpenTelemetry logging.)
pt_br: O Quarkus utiliza JBoss Logging como seu mecanismo de log e xref:logging.adoc[suporta várias APIs de logging]. (Isso é o logging normal em Java, não logging do OpenTelemetry.)

source: Avoid using errors and warnings for conditions that will not affect normal operation. These outputs can cause false alarms in user monitoring systems.
pt_br: Evite usar erros e avisos para condições que não afetarão a operação normal. Essas saídas podem causar alarmes falsos nos sistemas de monitoramento do usuário.

source: Define health endpoints
pt_br: Definir endpoints de saúde

source: Extensions may wish to xref:writing-extensions.adoc#extension-defined-endpoints[define library-specific endpoints] for health criteria which are specific to that extension. To add a new endpoint, extensions should produce a `NonApplicationRootPathBuildItem`.
pt_br: As extensões podem querer xref:writing-extensions.adoc#extension-defined-endpoints[definir endpoints específicos da biblioteca] para critérios de saúde que sejam específicos dessa extensão. Para adicionar um novo endpoint, as extensões devem produzir um `NonApplicationRootPathBuildItem`.

source: Tracing context
pt_br: Contexto de rastreamento

source: You should test that OpenTelemetry output for applications using your extension have properly-defined spans. You may need to do extra work to ensure spans are created with the right tracing ID. For example, extensions which have reactive internals should support xref:duplicated-context.adoc[duplicated contexts] for correct context propagation.
pt_br: Você deve testar se a saída do OpenTelemetry para aplicações que utilizam sua extensão possui spans definidos. Talvez seja necessário realizar trabalho adicional para garantir que os spans sejam criados com o ID de rastreamento correto. Por exemplo, as extensões que possuem internos reativos devem suportar xref:duplicated-context.adoc[contextos duplicados] para a propagação de contexto correta.

source: Advanced Kubernetes and containers integration
pt_br: Integração avançada de Kubernetes e contêineres

source: Quarkus is designed to be a Kubernetes-native runtime. Extensions can continue this philosophy by adding library-specific integration points with Kubernetes. Being Kubernetes-native implies being container-native. At a minimum, extensions should always work well in containers, but extensions may also have opportunities to integrate with the lower levels of the container stack.
pt_br: O Quarkus foi projetado para ser um runtime nativo do Kubernetes. As extensões podem dar continuidade a essa filosofia adicionando pontos de integração específicos de bibliotecas com o Kubernetes. Ser nativo do Kubernetes implica ser nativo do contêiner. No mínimo, as extensões devem sempre funcionar bem em contêineres, mas também podem ter oportunidades para se integrar aos níveis inferiores da pilha de contêineres.

source: References
pt_br: Referências

source: xref:writing-extensions.adoc[Writing your own extension] guide
pt_br: Guia xref:writing-extensions.adoc[escrevendo sua própria extensão]

source: xref:building-my-first-extension.adoc[Building your first extension]
pt_br: xref:building-my-first-extension.adoc[Criando sua primeira extensão]

source: link:https://hub.quarkiverse.io.adoc[The Quarkiverse Hub documentation]
pt_br: link:https://hub.quarkiverse.io.adoc[Documentação do Quarkiverse Hub]
